{
  "education": [
    {
      "awards_achievements": [
        "Honours Degree",
        "Consistent Dean's List"
      ],
      "degree": "BSc (Honours), Computer Science. Software Engineering concentration",
      "department": "Computer Science",
      "duration": "SEP2015-DEC2020",
      "school_name": "Ryerson University"
    },
    {
      "awards_achievements": [
        "Professional Designation"
      ],
      "degree": "CPA, CGA Certification",
      "department": "Accounting",
      "duration": "SEP2009-DEC2014",
      "school_name": "CGA Canada"
    },
    {
      "awards_achievements": [
        "Honours Degree"
      ],
      "degree": "Bachelor of Applied Business Administration Accounting and IT",
      "department": "Business Administration",
      "duration": "SEP2010-DEC2013",
      "school_name": "SAIT Polytechnic"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JjFalcon",
  "highlighted_projects": [
    {
      "description": "Developed a python application program that converts an Excel file to be AODA [Accessibility for Ontarians with Disabilities Act] compliant. The program is built with a user friendly GUI using TKinter with error checking and uses the openpyxl library.",
      "git_url": "https://github.com/f57c0n/gitPersonal/tree/master/projects_coop/project_AODAConverter",
      "name": "Coop Work Projects: AODA Converter"
    },
    {
      "description": "Developed a python application program that reads, analyzes and cleans a CSV file before migrating data to a remote RDBMS.  It provides DML options to review the file and a commit/rollback options before actual data migration.  The program uses the panda and sqlite3 library.",
      "git_url": "https://github.com/f57c0n/gitPersonal/tree/master/projects_coop/project_SQLLoader",
      "name": "Coop Work Projects:  SQL Loader"
    }
  ],
  "jarvis_projects": [
    {
      "description": " A Bash-based monitoring agent that collects the hardware specifications of nodes connected to a Linux cluster and routinely monitors their resource usage statistics. Deployed the application using Docker which is used to create a PostgreSQL instance to manage both static and dynamic data collection. Provided sample DML scripts to produce reports for resource planning. ",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Follows the MVC architecture and utilizes the Twitter RESTful API using the Apache HTTPComponents library to enable a Twitter user to fetch, post, and delete tweets.  Tested using Maven's JUnit testing and deployed via Docker.",
        "JDBC App: Demonstrates the DAO/DTO implementation of JDBC to a PostgreSQL RDBMS.  Implemented and tested basic CRUD and DML operations.",
        "Grep App: Simulates the Unix grep implementation that searches all files recursively from a given directory argument and outputs a file containing all the lines that match the given regex pattern argument.  Deployed via Docker."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": " A POC development of a trading platform that allows users to manage client profiles and accounts, monitor portfolio performance and trade securities. The microservices are auto-configured using SpringBoot and utilize Apache Tomcat as the embedded servlet. The app is built within a Spring Framework to facilitate a decoupling via IoC. The app fetches data from IEX Cloud via its REST API and persisted to a PostgreSQL DB via Docker containers. ",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": " A POC development to provide sample business intelligence about sales trend and customer portfolio. This application ran on the Jupyter Notebook environment that accesses the file ingested into a PostgreSQL DB via Docker containers. The app utilizes the Pandas Dataframe and Matplotlib to provide the relevant business intelligence and charts. ",
      "git_url": "/python_data_wrangling",
      "name": "Python Data Analytics"
    },
    {
      "description": "COMING SOON",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "COMING SOON",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "COMING SOON",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "JJ Falcon",
  "others": [
    {
      "bullets": [
        "ACTIVITIES/HOBBIES:",
        "Gardening",
        "Volunteer, Carnegie Community Centre:  Kitchen Help"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": " Implemented multiple progressive projects in a scrum environment following the Software Development Life Cycle using the agile methodology. Exposure includes architecture design, implementation via Bash scripts and Java, using IntelliJ with Maven build automation, and JUnit testing. Project details are mentioned under the Jarvis Project Listing above. ",
      "duration": "MAR2021-present",
      "title": "Data Engineer"
    },
    {
      "company": "Ontario Ministry of Health",
      "description": " Designed and developed a program to convert an excel file to be AODA (Accessibility for Ontarians with Disabilities) compliant using TkInter as GUI and python openpyxl library.  Also designed use-cases for testing and provided ongoing maintenance/updates. Designed and developed a program to load external data files into DB with several menu options to manipulate data first before loading to Oracle/SQLite using python pandas and oracle/sqlite3 libraries. Researched and provided proof of concepts and illustrations on providing predictive data models as a service to end-users via Azure. Debugged and redesigned old VBA codes used to automate Excel file processes and assisted with JS implementation in Cognos. Collaborated with project managers on the design of the application programs. ",
      "duration": "JAN2020-APR2020",
      "title": "Application Programmer – COOP"
    },
    {
      "company": "Symcor Inc.",
      "description": " Assisted in qualitative research to gain an understanding of the human needs involved in designing solutions and to help reframe the problem in human-centric ways through the design thinking process. Research work also included trends in solutions and the competitive landscape. Distilled information from the qualitative research to create design thinking personas and to generate multiple solution ideas for that persona. Adopted a hands-on approach in prototyping those ideas; including mock-ups and wireframes using Adobe XD. Maintained and updated internal website built on PHP. Mostly front-end work. ",
      "duration": "MAY2019-DEC2019",
      "title": "Software Development – COOP"
    },
    {
      "company": "Rogers Communication",
      "description": " Accessed information in the databases to create data extracts and cleansing, transformations, and summaries by using Proc SQL scripting within SAS Enterprise, and provided these for marketing initiatives. Visualized data through excel dashboards utilizing pivot tables and charts which are then used in PowerPoint presentations to internal/external teams within the marketing and sales business unit. Analyzed data to look at patterns and unusual data, and perform sample testing and/or research to validate them. Constructed supervised and unsupervised churn models within SAS Miner and ensured their end-to-end performance validation. ",
      "duration": "SEP2018-DEC2018",
      "title": "Predictive Modelling Analyst – COOP"
    }
  ],
  "skills": {
    "competent": [
      "Linux/Bash",
      "Docker",
      "Javascript",
      "UML Diagrams",
      "GIT"
    ],
    "familiar": [
      "HTML/CSS",
      "Bootstrap",
      "JIRA",
      "C",
      "VBA",
      "Prolog for AI",
      "PHP/React/Node JS",
      "R / Hadoop",
      "Axure / GCP",
      "SAS Enterprise Guide and Miner / Cognos / MicroStrategy BI"
    ],
    "proficient": [
      "Java",
      "Python",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Data Structures and Algorithms"
    ]
  },
  "summary": " I completed my bachelor's degree in Computer Science at Ryerson University with a software engineering concentration in December 2020. The concentration allowed me to focus my academics and excelled on the entire Software Development Life Cycle. It also exposed me to different Data Management Methodologies. I have gained a great understanding and hands-on experience of the software development life cycle throughout my coop experiences. This includes business requirements gathering, designing solutions, and implementing and maintaining the solution to produce meaningful results to the organization. Additionally, through the Jarvis training program, I have had the opportunity to use additional technologies in manipulating and mining data. I am a quick learner, analytical thinker with a customer-centric approach to my work ethic. I am a firm believer that success at work means helping others be better at what they do. There is no greater motivation for me than to see my work or be a part of a team whose work directly impacts making other people's lives easier. This is what excites me about the software industry. "
}
